; domain
(define (domain blocksworld)
(:predicates (clear ?x)
             (ontable ?x)
             (on ?x ?y))

(:action move-b-to-b
  :parameters (?bm ?bf ?bt)
  :precondition (and (clear ?bm) (clear ?bt) (on ?bm ?bf))
  :effect (and (not (clear ?bt)) (not (on ?bm ?bf))
               (on ?bm ?bt) (clear ?bf)))

(:action move-b-to-t
  :parameters (?bm ?bf)
  :precondition (and (clear ?bm) (on ?bm ?bf))
  :effect (and (not (on ?bm ?bf))
               (ontable ?bm) (clear ?bf)))

(:action move-t-to-b
  :parameters (?bm ?bt)
  :precondition (and (clear ?bm) (clear ?bt) (ontable ?bm))
  :effect (and (not (clear ?bt)) (not (ontable ?bm))
               (on ?bm ?bt))))

; problem
(define (problem BW-rand-8)
(:domain blocksworld)
(:objects b1 b2 b3 b4 b5 b6 b7 b8 )
(:init
(ontable b1)
(on b2 b4)
(ontable b3)
(on b4 b8)
(on b5 b2)
(ontable b6)
(ontable b7)
(ontable b8)
(clear b1)
(clear b3)
(clear b5)
(clear b6)
(clear b7)
)
(:goal
(and
(on b1 b6)
(on b2 b3)
(on b4 b2)
(on b6 b7)
(on b8 b1))
)
)

; plan
1. (move-t-to-b b6 b7)
   deleted: (clear b7) (ontable b6)
   added: (on b6 b7)
   goals met: 1 of 5
2. (move-b-to-b b5 b2 b5)
   deleted: (clear b5) (on b5 b2)
   added: (on b5 b5) (clear b2)
   goals met: 1 of 5
3. (move-b-to-b b2 b4 b3)
   deleted: (clear b3) (on b2 b4)
   added: (on b2 b3) (clear b4)
   goals met: 2 of 5
4. (move-b-to-b b4 b8 b2)
   deleted: (clear b2) (on b4 b8)
   added: (on b4 b2) (clear b8)
   goals met: 3 of 5
5. (move-t-to-b b1 b6)
   deleted: (clear b6) (ontable b1)
   added: (on b1 b6)
   goals met: 4 of 5
6. (move-t-to-b b8 b1)
   deleted: (clear b1) (ontable b8)
   added: (on b8 b1)
   goals met: 5 of 5
